define(function(require) {

    var echarts = require('echarts');
    require('echarts/chart/chord');

    var ec;

    function init(dom) {
        if (ec) {
            return;
        }
        ec = echarts.init(dom);

        ec.setOption({
            color : [
                '#FBB367','#80B1D2','#FB8070','#CC99FF','#B0D961',
                '#99CCCC','#BEBBD8','#FFCC99','#8DD3C8','#FF9999',
                '#CCEAC4','#BB81BC','#FBCCEC','#CCFF66','#99CC66',
                '#66CC66','#FF6666','#FFED6F','#ff7f50','#87cefa',
            ],
            title : {
                text : '中东地区的敌友关系',
                subtext: '数据来自财新网',
                sublink: 'http://international.caixin.com/2013-09-06/100579154.html',
                x:'right',
                y:'bottom',
                textStyle: {
                    color: 'white'
                },
                subtextStyle: {
                    color: 'white'
                }
            },
            toolbox: {
                show : true,
                feature : {
                    restore : {show: true},
                    saveAsImage : {show: true}
                }
            },
            tooltip : {
                trigger: 'item',
                formatter : function (params) {
                    var g1 = params[1];
                    var serie = params[0];
                    var g2 = params[3];
                    var data = params[2];
                    var data2 = params[4];
                    if (data2) {
                        if (data > data2) {
                            return [g1, serie, g2].join(' ');
                        } else {
                            return [g2, serie, g1].join(' ');
                        }
                    } else {
                        return g1
                    }
                }
            },
            legend : {
                data : [
                    '美国',
                    '叙利亚反对派',
                    '阿萨德',
                    '伊朗',
                    '塞西',
                    '哈马斯',
                    '以色列',
                    '穆斯林兄弟会',
                    '基地组织',
                    '俄罗斯',
                    '黎巴嫩什叶派',
                    '土耳其',
                    '卡塔尔',
                    '沙特',
                    '黎巴嫩逊尼派',
                    '',
                    '支持',
                    '反对',
                    '未表态'
                ],
                textStyle: {
                    color: 'white'
                },
                orient : 'vertical',
                x : 'left'
            },
            series : [
                {
                    "name": "支持",
                    "type": "chord",
                    "showScaleText": false,
                    "itemStyle": {
                        "normal": {
                            "label": {
                                "color": "white",
                                "rotate": true
                            }
                        }
                    },
                    "data": [
                        {"name": "美国"},
                        {"name": "叙利亚反对派"},
                        {"name": "阿萨德"},
                        {"name": "伊朗"},
                        {"name": "塞西"},
                        {"name": "哈马斯"},
                        {"name": "以色列"},
                        {"name": "穆斯林兄弟会"},
                        {"name": "基地组织"},
                        {"name": "俄罗斯"},
                        {"name": "黎巴嫩什叶派"},
                        {"name": "土耳其"},
                        {"name": "卡塔尔"},
                        {"name": "沙特"},
                        {"name": "黎巴嫩逊尼派"}
                    ],
                    "matrix": [
                        [0,100,0,0,0,0,100,0,0,0,0,0,0,0,0],
                        [10,0,0,0,0,10,10,0,10,0,0,10,10,10,10],
                        [0,0,0,10,0,0,0,0,0,10,10,0,0,0,0],
                        [0,0,100,0,0,100,0,0,0,0,100,0,0,0,0],
                        [0,0,0,0,0,0,0,0,0,0,0,0,0,10,0],
                        [0,100,0,10,0,0,0,0,0,0,0,0,10,0,0],
                        [10,100,0,0,0,0,0,0,0,0,0,0,0,0,0],
                        [0,0,0,0,0,0,0,0,0,0,0,10,10,0,0],
                        [0,100,0,0,0,0,0,0,0,0,0,0,0,0,0],
                        [0,0,100,0,0,0,0,0,0,0,0,0,0,0,0],
                        [0,0,100,10,0,0,0,0,0,0,0,0,0,0,0],
                        [0,100,0,0,0,0,0,100,0,0,0,0,0,0,0],
                        [0,100,0,0,0,100,0,100,0,0,0,0,0,0,0],
                        [0,100,0,0,100,0,0,0,0,0,0,0,0,0,100],
                        [0,100,0,0,0,0,0,0,0,0,0,0,0,10,0]
                    ]
                },
                {
                    "name": "反对",
                    "type": "chord",
                    "showScaleText": false,
                    "data": [
                        {"name": "美国"},
                        {"name": "叙利亚反对派"},
                        {"name": "阿萨德"},
                        {"name": "伊朗"},
                        {"name": "塞西"},
                        {"name": "哈马斯"},
                        {"name": "以色列"},
                        {"name": "穆斯林兄弟会"},
                        {"name": "基地组织"},
                        {"name": "俄罗斯"},
                        {"name": "黎巴嫩什叶派"},
                        {"name": "土耳其"},
                        {"name": "卡塔尔"},
                        {"name": "沙特"},
                        {"name": "黎巴嫩逊尼派"}
                    ],
                    "matrix": [
                        [0,0,100,100,0,100,0,0,100,0,0,0,0,0,0],
                        [0,0,0,10,0,0,0,0,0,10,10,0,0,0,0],
                        [10,0,0,0,0,0,10,10,10,0,0,10,10,0,10],
                        [10,100,0,0,0,0,0,0,0,0,0,0,0,0,0],
                        [0,0,0,0,0,10,0,100,0,0,0,10,10,0,0],
                        [10,0,0,0,100,0,10,0,0,0,0,0,0,0,0],
                        [0,0,100,0,0,100,0,0,0,0,0,0,0,0,0],
                        [0,0,100,0,10,0,0,0,0,0,0,0,0,10,0],
                        [10,0,100,0,0,0,0,0,0,0,0,0,0,100,0],
                        [0,100,0,0,0,0,0,0,0,0,0,0,0,0,0],
                        [0,100,0,0,0,0,0,0,0,0,0,0,0,0,0],
                        [0,0,100,0,100,0,0,0,0,0,0,0,0,0,0],
                        [0,0,100,0,100,0,0,0,0,0,0,0,0,0,0],
                        [0,0,0,0,0,0,0,100,10,0,0,0,0,0,0],
                        [0,0,100,0,0,0,0,0,0,0,0,0,0,0,0]
                    ]
                },
                {
                    "name": "未表态",
                    "type": "chord",
                    "showScaleText": false,
                    "data": [
                        {"name": "美国"},
                        {"name": "叙利亚反对派"},
                        {"name": "阿萨德"},
                        {"name": "伊朗"},
                        {"name": "塞西"},
                        {"name": "哈马斯"},
                        {"name": "以色列"},
                        {"name": "穆斯林兄弟会"},
                        {"name": "基地组织"},
                        {"name": "俄罗斯"},
                        {"name": "黎巴嫩什叶派"},
                        {"name": "土耳其"},
                        {"name": "卡塔尔"},
                        {"name": "沙特"},
                        {"name": "黎巴嫩逊尼派"}
                    ],
                    "matrix": [
                        [0,0,0,0,100,0,0,100,0,0,0,0,0,0,0],
                        [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
                        [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
                        [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
                        [10,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
                        [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
                        [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
                        [10,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
                        [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
                        [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
                        [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
                        [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
                        [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
                        [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
                        [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0]
                    ]
                }
            ]
        });
    }

    function dispose() {
        if (ec) {
            ec.clear();
            ec = null;
        }
    }

    return {
        init: init,
        dispose: dispose
    }
});